RedditClone/app/views/subs/show.html.erb

SELECT "post_subs".* FROM "post_subs" WHERE "post_subs"."sub_id" = $1  [["sub_id", 1]]
SELECT "subs".* FROM "subs"
---

  <% Sub.all.each do |sub| %>