RedditClone/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.user_id = current_user.id
        if @comment.save
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "sdaf"], ["user_id", 1], ["post_id", 2], ["created_at", "2019-05-07 20:42:36.078790"], ["updated_at", "2019-05-07 20:42:36.078790"], ["parent_comment_id", 0]]