RedditClone/app/controllers/posts_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def new
    @post = Post.new
    @sub = Sub.find(params[:sub_id])

INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hey fam"], ["url", "https://cdn.foodbeast.com/content/uploads/2015/05/gallonwater-1-770x513.jpg"], ["content", "Drink Up"], ["sub_id", 1], ["user_id", 1]]
INSERT INTO "post_subs" ("post_id", "sub_id") VALUES ($1, $2) RETURNING "id"  [["post_id", 2], ["sub_id", 1]]
INSERT INTO "post_subs" ("post_id", "sub_id") VALUES ($1, $2) RETURNING "id"  [["post_id", 3], ["sub_id", 1]]
---
   def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.sub_id = params[:sub_id]
        if @post.save
            params[:post][:subs_id].each do |s_id|
                Post_sub.create(post_id: @post.id, sub_id: s_id )

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
   def destroy
    @post = current_user.posts.find(params[:id])
    if @post.destroy