RedditClone/app/controllers/subs_controller.rb

SELECT "post_subs".* FROM "post_subs" WHERE "post_subs"."sub_id" = $1  [["sub_id", 1]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subs".* FROM "subs"
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]
---
    def show
        @sub = Sub.find_by(id: params[:id])
        @post_subs = @sub.post_subs.includes(:post)