RedditClone/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---

<% Comment.parentless_comments_by_post_id(@post.id).each do |comment|%>