RedditClone/app/models/comment.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."parent_comment_id" = $1 LIMIT $2  [["parent_comment_id", 1], ["LIMIT", 1]]
---
    def children
        my_children = Comment.where(parent_comment_id: self.id)

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_comment_id" IS NULL LIMIT $2  [["post_id", 2], ["LIMIT", 1]]
---
    def self.parentless_comments_by_post_id(post_id)
        Comment.where(post_id: post_id, parent_comment_id: nil)