RedditClone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "rW8xUkpE3v-ljYdUcWggPw"], ["updated_at", "2019-05-07 15:17:27.039556"], ["id", 1]]
---
    def reset_session_token
        self.update(session_token: SecureRandom::urlsafe_base64)